r"""
Special Functions

AUTHORS:
   -- David Joyner (2006-13-06)

Some of Maxima's and Pari's special functions are wrapped.

Maxima's "specfun" package (which includes spherical harmonic functions,
spherical Bessel functions (of the 1st and 2nd kind), and
spherical Hankel functions (of the 1st and 2nd kind))
was written by Barton Willis of the University of Nebraska at Kearney.
It is released under the terms of the General Public License (GPL). 

Support for elliptic functions and integrals was written by
Raymond Toy. It is placed under the terms of the General
Public License (GPL) that governs the distribution of Maxima.

The (usual) Bessel functions and Airy functions are part of the
standard Maxima package. Some Bessel functions also are implemented
in Pari. (Caution: The Pari versions are sometimes different than
the Maxima version.) For example, the K-Bessel function $K_\nu (z)$
can be computed using either Maxima or Pari, depending on an
optional variable you pass to bessel_K.

Next, we summarize some of the properties of the functions implemented
here.

\begin{itemize}
\item
{\it Bessel functions}, first defined by the Swiss mathematician
Daniel Bernoulli and named after Friedrich Bessel, are canonical
solutions y(x) of {\it Bessel's differential equation}:

\[
    x^2 \frac{d^2 y}{dx^2} + x \frac{dy}{dx} + (x^2 - \alpha^2)y = 0,
\]
for an arbitrary real number $\alpha$ (the order).

\item
Another important formulation of the two linearly independent
solutions to Bessel's equation are the {\it Hankel functions}
$H_\alpha^{(1)}(x)$ and $H_\alpha^(2)(x)$, defined by:

\[
    H_\alpha^{(1)}(x) = J_\alpha(x) + i Y_\alpha(x)
\]
\[
    H_\alpha^{(2)}(x) = J_\alpha(x) - i Y_\alpha(x)
\]
where $i$ is the imaginary unit (and $J_*$ and $Y_*$ are the
usual J- and Y-Bessel functions). These linear combinations are
also known as {\it Bessel functions of the third kind}; they are two
linearly independent solutions of Bessel's differential equation.
They are named for Hermann Hankel.

\item
{\it Airy function} The function $Ai(x)$ and the related
function $Bi(x)$, which is also called an {\it Airy function}, are
solutions to the differential equation

\[
    y'' - xy = 0,
\]
known as the {\it Airy equation}. They belong to the class of
"Bessel functions of fractional order". The initial conditions
$Ai(0) = (\Gamma(2/3)3^{2/3})^{-1}$,
$Ai'(0) = -(\Gamma(1/3)3^{1/3})^{-1}$ define $Ai(x)$.
The initial conditions $Bi(0) = 3^{1/2}Ai(0)$,
$Bi'(0) = -3^{1/2}Ai'(0)$ define $Bi(x)$.

They are named after the British astronomer George Biddell Airy.
 
\item
Spherical harmonics:
Laplace's equation in spherical coordinates is:
\[
  {1 \over r^2}{\partial \over \partial r}
  \left(r^2 {\partial f \over \partial r}\right) +
  {1 \over r^2\sin\theta}{\partial \over \partial \theta}
  \left(\sin\theta {\partial f \over \partial \theta}\right) +
  {1 \over r^2\sin^2\theta}{\partial^2 f \over \partial \varphi^2} = 0.
\]
Note that the spherical coordinates $\theta$
and $\varphi$ are defined here as follows:
$\theta$ is the colatitude or polar angle, ranging from
$0\leq\theta\leq\pi$ and $\varphi$ the azimuth or longitude,
ranging from $0\leq\varphi<2\pi$.

The general solution which remains finite towards infinity
is a linear combination of functions of the form
\[
    r^{-1-\ell} \cos (m \varphi) P_\ell^m (\cos{\theta} )
\]
and
\[
    r^{-1-\ell} \sin (m \varphi) P_\ell^m (\cos{\theta} )
\]
where $P_\ell^m$ are the associated {\it Legendre polynomials}, and
with integer parameters $\ell \ge 0$ and $m$ from $0$ to $\ell$.
Put in another way, the solutions with integer parameters
$\ell \ge 0$ and $- \ell\leq m\leq \ell$, can be written as
linear combinations of:
\[
    U_{\ell,m}(r,\theta , \varphi ) = r^{-1-\ell} Y_\ell^m( \theta , \varphi )
\]
where the functions $Y$ are the {\it spherical harmonic functions}
with parameters $\ell$, $m$, which can be written as:
\[
    Y_\ell^m( \theta , \varphi )
    = \sqrt{{(2\ell+1)\over 4\pi}{(\ell-m)!\over (\ell+m)!}}
      \cdot e^{i m \varphi } \cdot P_\ell^m ( \cos{\theta} ) .
\]

The spherical harmonics obey the normalisation condition

\[
\int_{\theta=0}^\pi\int_{\varphi=0}^{2\pi}
Y_\ell^mY_{\ell'}^{m'*}\,d\Omega
=\delta_{\ell\ell'}\delta_{mm'}\quad\quad d\Omega
=\sin\theta\,d\varphi\,d\theta .
\]

\item
When solving for separable solutions of Laplace's equation in
spherical coordinates, the radial equation has the form:
\[
    x^2 \frac{d^2 y}{dx^2} + 2x \frac{dy}{dx} + [x^2 - n(n+1)]y = 0.
\]
The {\it spherical Bessel functions} $j_n$ and $y_n$,
are two linearly independent solutions to this equation.
They are related to the ordinary Bessel functions $J_n$ and $Y_n$ by:
\[
    j_n(x) = \sqrt{\frac{\pi}{2x}} J_{n+1/2}(x),
\]
\[
    y_n(x) = \sqrt{\frac{\pi}{2x}} Y_{n+1/2}(x)
    = (-1)^{n+1} \sqrt{\frac{\pi}{2x}} J_{-n-1/2}(x). 
\]

\item
For $x>0$, the confluent hypergeometric function
$y = U(a,b,x)$ is defined to be the solution to Kummer's
differential equation

\[
xy'' + (b-x)y' - ay = 0,
\]
which satisfies $U(a,b,x) \sim x^{-a}$, as $x\rightarrow \infty$.
(There is a linearly independent solution, called Kummer's
function $M(a,b,x)$, which is not implemented.)


\item
Jacobi elliptic functions can be thought of as generalizations
of both ordinary and hyperbolic trig functions. 
There are twelve Jacobian elliptic functions. Each of the twelve
corresponds to an arrow drawn from one corner of a rectangle to
another.
\begin{verbatim}
             n ------------------- d
             |                     |
             |                     |
             |                     |
             s ------------------- c
\end{verbatim}             
             
Each of the corners of the rectangle are labeled, by convention,
s, c, d and n. The rectangle is understood to be lying on the complex
plane, so that s is at the origin, c is on the real axis,
and n is on the imaginary axis.
The twelve Jacobian elliptic functions are then pq(x), where p and q
are one of the letters s,c,d,n.

The {\it Jacobian elliptic functions} are then the unique
doubly-periodic, meromorphic functions satisfying the following
three properties:

\begin{enumerate}
\item
There is a simple zero at the corner p, and a simple pole
at the corner q.
\item
The step from p to q is equal to half the period of the function pq(x);
that is, the function pq(x) is periodic in the direction pq,
with the period being twice the distance from p to q.
Also, pq(x) is also periodic in the other two directions as well,
with a period such that the distance from p to one of the other corners
is a quarter period.
\item
If the function pq(x) is expanded in terms of x at one of the corners,
the leading term in the expansion has a coefficient of 1.
In other words, the leading term of the expansion of pq(x) at the
corner p is x; the leading term of the expansion at the corner
q is 1/x, and the leading term of an expansion at the other two
corners is 1.
\end{enumerate}

We can write
\[
pq(x)=\frac{pr(x)}{qr(x)}
\]
where $p$, $q$, and $r$ are any of the letters $s$, $c$, $d$, $n$,
with the understanding that $ss=cc=dd=nn=1$.

Let
\[
    u=\int_0^\phi \frac{d\theta} {\sqrt {1-m \sin^2 \theta}}
\]
Then the \emph{Jacobi elliptic function} $sn(u)$ is given by
\[
   {sn}\; u = \sin \phi
\]
and $cn(u)$ is given by

\[
  {cn}\; u = \cos \phi
\]
and
\[
{dn}\; u = \sqrt {1-m\sin^2 \phi}. 
\]
To emphasize the dependence on $m$, one can write
$sn(u,m)$ for example (and similarly for $cn$ and $dn$).
This is the notation used below.

For a given $k$ with $0 < k < 1$ they therefore are solutions to
the following nonlinear ordinary differential equations:

\begin{itemize}
\item
$\mathrm{sn}\,(x;k)$ solves the differential equations
\[
\frac{\mathrm{d}^2 y}{\mathrm{d}x^2} + (1+k^2) y - 2 k^2 y^3 = 0,
\]
and $\left(\frac{\mathrm{d} y}{\mathrm{d}x}\right)^2 = (1-y^2) (1-k^2 y^2)$.

\item
$\mathrm{cn}\,(x;k)$ solves the differential equations

\[
\frac{\mathrm{d}^2 y}{\mathrm{d}x^2} + (1-2k^2) y + 2 k^2 y^3 = 0,
\]
and $\left(\frac{\mathrm{d} y}{\mathrm{d}x}\right)^2
= (1-y^2) (1-k^2 + k^2 y^2)$.

\item
$\mathrm{dn}\,(x;k)$ solves the differential equations

\[
\frac{\mathrm{d}^2 y}{\mathrm{d}x^2} - (2 - k^2) y + 2 y^3 = 0,
\]
and $\left(\frac{\mathrm{d} y}{\mathrm{d}x}\right)^2
= y^2 (1 - k^2 - y^2)$.


If $K(m)$ denotes the {\it complete elliptic integral of the first kind}
(denoted \verb+elliptic_kc+), the elliptic functions $sn (x,m)$ and
$cn (x,m)$ have real periods $4K(m)$, whereas $dn (x,m)$ has a period
$2K(m)$. The limit $m\rightarrow 0$ gives
$K(0) = \pi/2$ and trigonometric functions: $sn(x, 0) = \sin x$,
$cn(x, 0) = \cos x$, $dn(x, 0) = 1$. The limit $m \rightarrow 1$
gives $K(1) \\rightarrow \infty$ and hyperbolic functions:
$sn(x, 1) = \tanh x$, $cn(x, 1) = \mbox{\rm sech} x$,
$dn(x, 1) = \mbox{\rm sech} x$. 

\item
The {\it incomplete elliptic integrals} (of the first kind,
etc.) are:
\[
\begin{array}{c}
\displaystyle\int_0^\phi \frac{1}{\sqrt{1 - m\sin(x)^2}}\, dx,\\
\displaystyle\int_0^\phi \sqrt{1 - m\sin(x)^2}\, dx,\\
\displaystyle\int_0^\phi \frac{\sqrt{1-mt^2}}{\sqrt(1 - t^2)}\, dx,\\
\displaystyle\int_0^\phi \frac{1}{\sqrt{1 - m\sin(x)^2\sqrt{1 - n\sin(x)^2}}}\, dx,
\end{array}
\]
and the {\it complete} ones are obtained by taking $\phi =\pi/2$.


\end{itemize}
\end{itemize}

\begin{verbatim}
Methods implemented:
    * Bessel functions and Airy functions
    * spherical harmonic functions
    * spherical Bessel functions (of the 1st and 2nd kind)
    * spherical Hankel functions (of the 1st and 2nd kind)
    * Jacobi elliptic functions
    * complete/incomplete elliptic integrals
    * hyperbolic trig functions (for completeness, since
      they are special cases of elliptic functions)
    
REFERENCE:
    * Abramowitz and Stegun: Handbook of Mathematical Functions,
      http://www.math.sfu.ca/~cbm/aands/
    * http://en.wikipedia.org/wiki/Bessel_function
    * http://en.wikipedia.org/wiki/Airy_function
    * http://en.wikipedia.org/wiki/Spherical_harmonics
    * http://en.wikipedia.org/wiki/Helmholtz_equation
    * http://en.wikipedia.org/wiki/Jacobi's_elliptic_functions
    * A. Khare, U. Sukhatme, "Cyclic Identities Involving
      Jacobi Elliptic Functions", Math ArXiv, math-ph/0201004
    * Online Encyclopedia of Special Function
      http://algo.inria.fr/esf/index.html
\end{verbatim}
 
"""

#*****************************************************************************
#       Copyright (C) 2006 William Stein <wstein@gmail.com>
#                     2006 David Joyner <wdj@usna.edu>
#
#  Distributed under the terms of the GNU General Public License (GPL)
#
#    This code is distributed in the hope that it will be useful,
#    but WITHOUT ANY WARRANTY; without even the implied warranty of
#    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
#    General Public License for more details.
#
#  The full text of the GPL is available at:
#
#                  http://www.gnu.org/licenses/
#*****************************************************************************

import copy
import sage.plot.plot
import sage.interfaces.all
from sage.rings.polynomial_ring import PolynomialRing
from sage.rings.rational_field import RationalField
from sage.rings.real_field import RealField
from sage.misc.sage_eval import sage_eval
from sage.rings.all import QQ, RR
import sage.rings.commutative_ring as commutative_ring
import sage.rings.ring as ring

from functions import *

from sage.misc.functional import exp

def _setup(prec):
    from sage.libs.pari.all import pari
    RR = RealField(int(prec/3.3)+1) ## 3.3 is about log(10,2)
    a = pari.get_real_precision()
    pari.set_real_precision(prec)
    return RR,a


def bessel_I(nu,z,alg = "pari",prec=53):
    r"""
    Implements the "I-Bessel function", or
    "modified Bessel function, 1st kind", with
    index (or "order") nu and argument z.

    INPUT:
        nu -- a real (or complex, for pari) number
        z  -- a real (positive)
        alg - "pari" or "maxima"
        prec - real precision (for Pari only)
    
    DEFINITION:
    \begin{verbatim}
    Maxima:
                     inf
                    ====   - nu - 2 k  nu + 2 k
                    \     2          z
                     >    -------------------
                    /     k! Gamma(nu + k + 1)
                    ====
                    k = 0

    Pari:
    
                     inf
                    ====   - 2 k  2 k
                    \     2      z    Gamma(nu + 1)
                     >    -----------------------
                    /       k! Gamma(nu + k + 1)
                    ====
                    k = 0

    \end{verbatim}
    Sometimes \code{bessel_I(nu,z)} is denoted \code{I_nu(z)} in the
    literature.

    WARNING:
       In Maxima (the manual says) i0 is deprecated but \code{bessel_i(0,*)}
       is broken. (Was fixed in recent CVS patch though.)

    EXAMPLES:
        sage: bessel_I(1,1,"pari",500)
        0.56515910399248502720769602760986330732889962158
        sage: bessel_I(1,1)
        0.5651627
        sage: bessel_I(2,1.1,"maxima")  # last few digits are random
        0.16708949925104899
        sage: bessel_I(0,1.1,"maxima")  # last few digits are random
        1.3261601837126531
        sage: bessel_I(0,1,"maxima")    # last few digits are random
        1.2660658777520091
    """
    if alg=="pari":
        from sage.libs.pari.all import pari
        R,a = _setup(prec)
        b = R(pari(z).besseli(nu))
        pari.set_real_precision(a)
        return b
    else:
        if nu==0:  
            return eval(maxima.eval("i0 (%s)"%z))   
        else:
            return eval(maxima.eval("bessel_i(%s,%s)"%(RR(nu),RR(z))))
        
def bessel_J(nu,z,alg="pari",prec=53):
    r"""
    Implements the "J-Bessel function", or
    "Bessel function, 1st kind", with
    index (or "order") nu and argument z.

    \begin{verbatim}
    Defn:
    Maxima:
                     inf
                    ====          - nu - 2 k  nu + 2 k
                    \     (-1)^k 2           z
                     >    -------------------------
                    /        k! Gamma(nu + k + 1)
                    ====
                    k = 0

    Pari:
    
                     inf
                    ====          - 2k    2k
                    \     (-1)^k 2      z    Gamma(nu + 1)
                     >    ----------------------------
                    /         k! Gamma(nu + k + 1)
                    ====
                    k = 0
    \end{verbatim}


    Sometimes bessel_J(nu,z) is denoted J_nu(z) in the
    literature.

    WARNING:
        Inaccurate for small values of z.
    
    EXAMPLES:
        sage: bessel_J(2,1.1)  # last few digits are random
        0.136564153956658000
        sage: bessel_J(0,1.1)  # last few digits are random
        0.719622018527510801
        sage: bessel_J(0,1)    # last few digits are random
        0.765197686557966605

    """
    if alg=="pari":
        from sage.libs.pari.all import pari
        R,a = _setup(prec)
        b = R(pari(z).besselj(nu))
        pari.set_real_precision(a)
        return b
    else:
        return RR(maxima.eval("bessel_j(%s,%s)"%(RR(nu),RR(z))))

def bessel_K(nu,z,prec=53):
    r"""
    Implements the "K-Bessel function", or
    "modifed Bessel function, 2nd kind", with
    index (or "order") nu and argument z. Defn:
\begin{verbatim}
            pi*(bessel_I(-nu, z) - bessel_I(nu, z))
           ----------------------------------------
                        2*sin(pi*nu)
\end{verbatim}

    if nu is not an integer and by taking a limit
    otherwise.
    
    Sometimes bessel_K(nu,z) is denoted K_nu(z) in the
    literature. In Pari, nu can be complex and
    x must be real and positive. 

    EXAMPLES:
        sage: bessel_K(1,1)
        0.6019058
        sage: bessel_K(1,1,500)
        0.60190723019723457473754000153561733926158688995

    """
    from sage.libs.pari.all import pari
    RR,a = _setup(prec)
    b = RR(pari(z).besselk(nu))
    pari.set_real_precision(a)
    return b

def bessel_Y(nu,z):
    r"""
    Implements the "Y-Bessel function", or
    "Bessel function of the 2nd kind", with
    index (or "order") nu and argument z. Defn:
\begin{verbatim}
            cos(pi n)*bessel_J(nu, z) - bessel_J(-nu, z)
           -------------------------------------------------
                             sin(nu*pi)
\end{verbatim}                             
    if nu is not an integer and by taking a limit
    otherwise.
    
    Sometimes bessel_Y(n,z) is denoted Y_n(z) in the
    literature.

    This is computed using Pari.
    
    EXAMPLES:
        sage: bessel_Y(2,1.1)         # last few digits are random
        -1.4314714939590090
        sage: bessel_Y(3.001,2.1)     # last few digits are random
        -1.0299574976424311

    NOTE: Adding "0"+ inside sage_eval as a temporary bug work-around.
    """
    return RR(maxima.eval("bessel_y(%s,%s)"%(RR(nu),RR(z))))

def hypergeometric_U(alpha,beta,x,prec=53):
    r"""
    Implements, for $x>0$, the confluent hypergeometric function
    $y = U(a,b,x)$ is defined to be the solution to Kummer's
    differential equation

    \[
    xy'' + (b-x)y' - ay = 0,
    \]
    which satisfies $U(a,b,x) \sim x^{-a}$, as $x\rightarrow \infty$.

    EXAMPLES:
        sage: hypergeometric_U(1,1,1)
        0.5963440
        sage: hypergeometric_U(1,1,1,200)
        0.59634736232319407413
    """
    from sage.libs.pari.all import pari
    R,a = _setup(prec)
    b = R(pari(x).hyperu(alpha,beta))
    pari.set_real_precision(a)
    return b

def incomplete_gamma(s,x,prec=53):
    r"""
    Implements the incomplete Gamma function.

    The argument x and s are complex numbers
    (x must be a positive real number if s = 0).
    The result returned is $\int_x^\infty e^{-t}t^{s-1}dt$.

    EXAMPLES:
        sage: incomplete_gamma(0.1,6,200)
        119.99999984701215694
        sage: incomplete_gamma(0,6,200)
        120.00000000000000000
        sage: incomplete_gamma(0.3,6,200)
        119.99990598341125736 
        sage: incomplete_gamma(0.3,6)
        120.0000
        sage: incomplete_gamma(0.5,6)
        119.9980
        sage: incomplete_gamma(0.5,6,100)
        119.99830019
    """
    from sage.libs.pari.all import pari
    R,a = _setup(prec)
    b = R(pari(x).incgam(s))
    pari.set_real_precision(a)
    return b

def spherical_bessel_J(n,x):
    r"""
    Returns the spherical Bessel function of the first kind
    for integers n > -1.
    Reference: A&S 10.1.8 page 437 and A&S 10.1.15 page 439.

    EXAMPLES:
        sage: x = PolynomialRing(QQ, 'x').gen()
        sage: spherical_bessel_J(2,x)
        '( - (1 - 3/x^2)*sin(x) - 3*cos(x)/x)/x'

    Here I = sqrt(-1).
    
    """
    maxima.eval('load("specfun")')
    R = x.parent()
    y = R.gen()
    return maxima.eval("spherical_bessel_j(%s,%s)"%(n,y)).replace("%i","I")

def spherical_bessel_Y(n,x):
    r"""
    Returns the spherical Bessel function of the second kind
    for integers n > -1.
    Reference: A&S 10.1.9 page 437 and A&S 10.1.15 page 439.

    EXAMPLES:
        sage: x = PolynomialRing(QQ, 'x').gen()
        sage: spherical_bessel_Y(2,x)
        '((1 - 3/x^2)*cos(x) - 3*sin(x)/x)/x'

    Here I = sqrt(-1).
    
    """
    maxima.eval('load("specfun")')
    R = x.parent()
    y = R.gen()
    return maxima.eval("spherical_bessel_y(%s,%s)"%(n,y)).replace("%i","I")

def spherical_hankel1(n,x):
    r"""
    Returns the spherical Hankel function of the first
    kind for integers $n > -1$, written as a string.
    Reference: A&S 10.1.36 page 439.

    EXAMPLES:
        sage: x = PolynomialRing(QQ, 'x').gen()
        sage: spherical_hankel1(2,x)
        'I*(3*I/x - 3/x^2 + 1)*%e^(I*x)/x'

    Here I = sqrt(-1).
    
    """
    maxima.eval('load("specfun")')
    R = x.parent()
    y = R.gen()
    return maxima.eval("spherical_hankel1(%s,%s)"%(n,y)).replace("%i","I")

def spherical_hankel2(n,x):
    r"""
    Returns the spherical Hankel function of the second
    kind for integers n > -1, written as a string.
    Reference: A&S 10.1.17 page 439.

    EXAMPLES:
        sage: x = PolynomialRing(QQ, 'x').gen()
        sage: spherical_hankel2(2,x)
        '-I*( - 3*I/x - 3/x^2 + 1)*%e^-(I*x)/x'

    Here I = sqrt(-1).
    
    """
    maxima.eval('load("specfun")')
    R = x.parent()
    y = R.gen()
    return maxima.eval("spherical_hankel2(%s,%s)"%(n,y)).replace("%i","I")

def spherical_harmonic(m,n,x,y):
    r"""
    Returns the spherical Harmonic function of the second
    kind for integers $n > -1$, $|m|\leq n$, written as a string.
    Reference: Merzbacher 9.64.

    EXAMPLES:
        sage: x = PolynomialRing(QQ, 'x').gen()
        sage: y = PolynomialRing(QQ, 'y').gen()
        sage: spherical_harmonic(3,2,x,y)
        '15*sqrt(7)*cos(x)*sin(x)^2*e^(2*I*y)/(4*sqrt(30)*sqrt(pi))'
        sage: spherical_harmonic(3,2,1,2)
        -0.25556469795208248 - 0.29589824630616246*I

    Here I = sqrt(-1).
    
    """
    maxima.eval('load("specfun")')
    if not(is_Polynomial(x) and is_Polynomial(y)):
        s1 = maxima.eval("spherical_harmonic(%s,%s,%s,%s)"%(m,n,x,y))
        s2 = s1.replace("%i","I")
        s3 = s2.replace("%pi","pi")
        s4 = s3.replace("%e","CC(e)")
        return sage_eval(s4)
    R = x.parent()
    x1 = R.gen()
    R = y.parent()
    y1 = R.gen()
    s1 = maxima.eval("spherical_harmonic(%s,%s,%s,%s)"%(m,n,x,y))
    s2 = s1.replace("%i","I")
    s3 = s2.replace("%pi","pi")
    s4 = s3.replace("%e","e")
    return s4

####### elliptic functions and integrals 

def jacobi(sym,x,m):
    r"""
    Here sym = "pq", where p,q in {c,d,n,s}. This returns the
    value of the Jacobi function pq(x,m), as described in the
    documentation for SAGE's "special" module. There are a
    total of 12 functions described by this.

    EXAMPLES:
        sage: jacobi("sn",1,1)
        0.76159415595576485
        sage: jacobi("cd",1,1/2)
        0.72400972165937116
        sage: jacobi("cn",1,1/2);jacobi("dn",1,1/2);jacobi("cn",1,1/2)/jacobi("dn",1,1/2)
        0.59597656767214113
        0.82316100163159622
        0.72400972165937116
        sage: jsn = lambda x: jacobi("sn",x,1)
        sage: P= plot(jsn,0,1)

    Now to view this, just type show(P).
    
    """
    #R = x.parent()
    #y = R.gen()
    if sym=="dc":
        return eval(maxima.eval("jacobi_sn(%s,%s)"%(RR(x),RR(m))))
    if sym=="nc":
        return eval(maxima.eval("jacobi_sn(%s,%s)"%(RR(x),RR(m))))
    if sym=="sc":
        return eval(maxima.eval("jacobi_sn(%s,%s)"%(RR(x),RR(m))))
    if sym=="cd":
        return eval(maxima.eval("jacobi_cd(%s,%s)"%(RR(x),RR(m))))
    if sym=="nd":
        return eval(maxima.eval("jacobi_nd(%s,%s)"%(RR(x),RR(m))))
    if sym=="sd":
        return eval(maxima.eval("jacobi_sd(%s,%s)"%(RR(x),RR(m))))
    if sym=="cn":
        return eval(maxima.eval("jacobi_cn(%s,%s)"%(RR(x),RR(m))))
    if sym=="dn":
        return eval(maxima.eval("jacobi_dn(%s,%s)"%(RR(x),RR(m))))
    if sym=="sn":
        return eval(maxima.eval("jacobi_sn(%s,%s)"%(RR(x),RR(m))))
    if sym=="cs":
        return eval(maxima.eval("jacobi_cs(%s,%s)"%(RR(x),RR(m))))
    if sym=="ds":
        return eval(maxima.eval("jacobi_ds(%s,%s)"%(RR(x),RR(m))))
    if sym=="ns":
        return eval(maxima.eval("jacobi_ns(%s,%s)"%(RR(x),RR(m))))
    return 1

def inverse_jacobi(sym,x,m):
    """
    Here sym = "pq", where p,q in {c,d,n,s}. This returns the
    value of the inverse Jacobi function $pq^{-1}(x,m)$. There are a
    total of 12 functions described by this.

    EXAMPLES:
        sage: jacobi("sn",1/2,1/2)
        0.4707504736556572
        sage: inverse_jacobi("sn",0.47,1/2)
        0.4990982313222197
        sage: inverse_jacobi("sn",0.4707504,1/2)
        0.49999991146655459
        sage: ijsn = lambda x: inverse_jacobi("sn",x,1/2)
        sage: P= plot(ijsn,0,1)

    Now to view this, just type show(P).
    
    """
    #R = x.parent()
    #y = R.gen()
    if sym=="dc":
        return eval(maxima.eval("inverse_jacobi_sn(%s,%s)"%(RR(x),RR(m))))
    if sym=="nc":
        return eval(maxima.eval("inverse_jacobi_sn(%s,%s)"%(RR(x),RR(m))))
    if sym=="sc":
        return eval(maxima.eval("inverse_jacobi_sn(%s,%s)"%(RR(x),RR(m))))
    if sym=="cd":
        return eval(maxima.eval("inverse_jacobi_cd(%s,%s)"%(RR(x),RR(m))))
    if sym=="nd":
        return eval(maxima.eval("inverse_jacobi_nd(%s,%s)"%(RR(x),RR(m))))
    if sym=="sd":
        return eval(maxima.eval("inverse_jacobi_sd(%s,%s)"%(RR(x),RR(m))))
    if sym=="cn":
        return eval(maxima.eval("inverse_jacobi_cn(%s,%s)"%(RR(x),RR(m))))
    if sym=="dn":
        return eval(maxima.eval("inverse_jacobi_dn(%s,%s)"%(RR(x),RR(m))))
    if sym=="sn":
        return eval(maxima.eval("inverse_jacobi_sn(%s,%s)"%(RR(x),RR(m))))
    if sym=="cs":
        return eval(maxima.eval("inverse_jacobi_cs(%s,%s)"%(RR(x),RR(m))))
    if sym=="ds":
        return eval(maxima.eval("inverse_jacobi_ds(%s,%s)"%(RR(x),RR(m))))
    if sym=="ns":
        return eval(maxima.eval("inverse_jacobi_ns(%s,%s)"%(RR(x),RR(m))))
    return 1

#### elliptic integrals

def spherical_hankel2(n,x):
    """
    Returns the spherical Hankel function of the second
    kind for integers n > -1, written as a string.
    Reference: A&S 10.1.17 page 439.

    EXAMPLES:
        sage: x = PolynomialRing(QQ, 'x').gen()
        sage: spherical_hankel2(2,x)
        '-I*( - 3*I/x - 3/x^2 + 1)*%e^-(I*x)/x'

    Here I = sqrt(-1).
    
    """
    maxima.eval('load("specfun")')
    R = x.parent()
    y = R.gen()
    return maxima.eval("spherical_hankel2(%s,%s)"%(n,y)).replace("%i","I")


#### hyperboic trig functions (which are special cases
#### of Jacobi elliptic functions but faster to evaluate directly)

def sinh(t):
    try:
        return t.sinh()
    except AttributeError:
        return (exp(t)-exp(-t))/2

def cosh(t):
    try:
        return t.cosh()
    except AttributeError:
        return (exp(t)+exp(-t))/2

def tanh(t):
    try:
        return t.tanh()
    except AttributeError:
        return sinh(t)/cosh(t)

def coth(t):
    try:
        return t.coth()
    except AttributeError:
        return 1/tanh(t)

def sech(t):
    try:
        return t.sech()
    except AttributeError:
        return 1/cosh(t)

def csch(t):
    try:
        return t.csch()
    except AttributeError:
        return 1/sinh(t)

def dilog(t):
    """
    Te dilogarithm of t is the analytic continuation of the
    power series $\sum_{n \geq 1} t^n/n^2$.
    """
    try:
        return t.dilog()
    except AttributeError:
        raise NotImplementedError

def lngamma(t):
    """
    The principal branch of the logarithm of the Gamma function of t. 
    """
    try:
        return t.lngamma()
    except AttributeError:
        raise NotImplementedError

def exp_int(t):
    r"""
    The exponential integral $\int_x^\infty e^{-x}/x dx$ (t belongs to RR).
    """
    try:
        return t.eint1()
    except AttributeError:
        raise NotImplementedError

def error_fcn(t):
    r"""
    The complementary error function
    $\frac{2}{\sqrt{\pi}}\int_t^\infty e^{-x^2} dx$ (t belongs to RR).
    """
    try:
        return t.erfc()
    except AttributeError:
        raise NotImplementedError



