r"""
\section{Warning}

This tutorial outlines what you need to know in order to use $p$-adics
in SAGE  effectively.

The $p$-adics in SAGE are currently undergoing a transformation.
Prior to SAGE-2.1, SAGE included a single class representing $\Qp$,
and a single class representing elements of $\Qp$.  Our goal is to
create a rich structure of different options that will reflect the
mathematical structures of the $p$-adics.  This is very much a work in
progress: some of the classes that we eventually intend to include
have not yet been written, and some of the functionality for classes
in existence has not yet been implemented.  In addition, while we
strive for perfect code, bugs (both subtle and not-so-subtle) continue
to evade our clutches.  As a user, you serve an important role.  By
writing non-trivial code that uses the $p$-adics, you both give us
insight into what features are actually used and also expose problems
in the code for us to fix.

Our design philosophy has been to create a robust, usable interface
working first, with simple-minded implementations underneath.  We want
this interface to stabilize rapidly, so that users' code does not have
to change.  Once we get the framework in place, we can go back and
work on the algorithms and implementations underneath.  All of the
current $p$-adic code is currently written in pure Python, which means
that it does not have the speed advantage of compiled code.  Thus our
$p$-adics can be painfully slow at times when you're doing real
computations.  However, finding and fixing bugs in Python code is
\emph{far} easier than finding and fixing errors in the compiled
alternative within SAGE (SageX), and Python code is also faster and
easier to write.  We thus have significantly more functionality
implemented and working than we would have if we had chosen to focus
initially on speed.  And at some point in the future, we will go back
and improve the speed.  Any code you have written on top of our
$p$-adics will then get an immediate performance enhancement.

If you do find bugs, have feature requests or general comments, please
email {\tt sage-support@groups.google.com} or
{\tt roed@math.harvard.edu}.

\section{Terminology and types of $p$-adics}

To write down a general $p$-adic element completely would require an infinite
amount of data.  Since computers do not have infinite storage space,
we must instead store finite approximations to elements.  Thus, just
as in the case of floating point numbers for representing reals, we
have to store an element to a finite precision level.  The different
ways of doing this account for the different types of $p$-adics.

We can think of $p$-adics in two ways.  First, as a projective limit
of finite groups: $$\Zp = \lim_{\leftarrow n} \Zpn.$$ Secondly, as
Cauchy sequences of rationals (or integers, in the case of $\Zp$)
under the $p$-adic metric.  Since we only need to consider these
sequences up to equivalence, this second way of thinking of the
$p$-adics is the same as considering power series in $p$ with integral
coefficients in the range $0$ to $p-1$.  If we only allow nonnegative
powers of $p$ then these power series converge to elements of $\Zp$,
and if we allow bounded negative powers of $p$ then we get $\Qp$.

Both of these representations give a natural way of thinking about
finite approximations to a $p$-adic element.  In the first
representation, we can just stop at some point in the projective
limit, giving an element of $\Zpn$.  As $\Zp / p^n\Zp \cong \Zpn$,
this is is equivalent to specifying our element modulo $p^n\Zp$.

\begin{definition}
The \emph{absolute precision} of a finite approximation $\bar{x} \in \Zpn$ to $x \in \Zp$
is the non-negative integer $n$.
\end{definition}

In the second representation, we can achieve the same thing by
truncating a series
$$
 a_0 + a_1 p + a_2 p^2 + \cdots
$$
at $p^n$, yielding
$$
a_0 + a_1 p + \cdots + a_{n-1} p^{n-1} + O(p^n).
$$
As above, we call this $n$ the absolute precision of our element.

Given any $x \in \Qp$ with $x \ne 0$, we can write $x = p^v u$ where
$v \in \ZZ$ and $u \in \Zpx$.  We could thus also store an element of
$\Qp$ (or $\Zp$) by storing $v$ and a finite approximation of $u$.
This motivates the following definition: \begin{definition} The
\emph{relative precision} of an approximation to $x$ is defined as the
absolute precision of the approximation minus the valuation of $x$.
\end{definition} For example, if $x = a_k p^k + a_{k+1} p^{k+1} +
\cdots + a_{n-1} p^{n-1} + O(p^n)$ then the absolute precision of $x$
is $n$, the valuation of $x$ is $k$ and the relative precision of $x$
is $n-k$.

There are four different representations of $\Zp$ in SAGE and two
representations of $\Qp$:
\begin{itemize}
\item the fixed modulus ring
\item the capped absolute precision ring
\item the capped relative precision ring
\item the capped relative precision field
\item the lazy ring, and
\item the lazy field.
\end{itemize}

\subsection{Fixed Modulus Rings}

The first, and simplest, type of $\Zp$ is basically a wrapper around
$\Zpn$, providing a unified interface with the rest of the $p$-adics.
You specify a precision, and all elements are stored to that absolute
precision.  If you perform an operation that would normally lose
precision, the element does not track that it no longer has full
precision.

The fixed modulus ring provides the lowest level of convenience, but
it is also the one that has the lowest computational overhead.  Once
we have ironed out some bugs, the fixed modulus elements will be those
most optimized for speed.

As with all of the implementations of $\Zp$, one creates a new ring using the constructor
\verb/Zp/, and passing in \verb/'fixed-mod'/ for the \verb/type/ parameter.  For example,
\begin{verbatim}
sage: R = Zp(5, prec = 10, type = 'fixed-mod', print_mode = 'series')
sage: R
5-adic Ring of fixed modulus 5^10

\end{verbatim}

One can create elements as follows:
\begin{verbatim}
sage: a = R(375)
sage: a
3*5^3 + O(5^10)
sage: b = R(105)
sage: b
5 + 4*5^2 + O(5^10)

\end{verbatim}

Now that we have some elements, we can do arithmetic in the ring.
\begin{verbatim}
sage: a + b
5 + 4*5^2 + 3*5^3 + O(5^10)
sage: a * b
3*5^4 + 2*5^5 + 2*5^6 + O(5^10)

\end{verbatim}

Floor division (//) divides even though the result
isn't really known to the claimed precision; note that
division isn't defined:
\begin{verbatim}
sage: a // 5
3*5^2 + O(5^10)

sage: a / 5
Traceback (most recent call last):
...
ValueError: cannot invert non-unit

\end{verbatim}




Since elements don't actually store their actual precision, one can only divide by units:
\begin{verbatim}
sage: a / 2
4*5^3 + 2*5^4 + 2*5^5 + 2*5^6 + 2*5^7 + 2*5^8 + 2*5^9 + O(5^10)
sage: a / b
Traceback (most recent call last):
...
ValueError: cannot invert non-unit

\end{verbatim}

If you want to divide by a non-unit, do it using the \verb@//@ operator:
\begin{verbatim}
sage: a // b
3*5^2 + 3*5^3 + 2*5^5 + 5^6 + 4*5^7 + 2*5^8 + O(5^10)

\end{verbatim}

\subsection{Capped Absolute Rings}
The second type of implementation of $\Zp$ is similar to the fixed modulus implementation,
except that individual elements track their known precision. 
The absolute precision of each element is limited to be less than the precision cap of the ring,
even if mathematically the precision of the element would be known to greater precision
(see Appendix A for the reasons for the existence of a precision cap).

Once again, use \verb/Zp/ to create a capped absolute $p$-adic ring.
\begin{verbatim}
sage: R = Zp(5, prec = 10, type = 'capped-abs', print_mode = 'series')
sage: R
5-adic Ring with capped absolute precision 10

\end{verbatim}

We can do similar things as in the fixed modulus case:
\begin{verbatim}
sage: a = R(375)
sage: a
3*5^3 + O(5^10)
sage: b = R(105)
sage: b
5 + 4*5^2 + O(5^10)
sage: a + b
5 + 4*5^2 + 3*5^3 + O(5^10)
sage: a * b
3*5^4 + 2*5^5 + 2*5^6 + O(5^10)
sage: c = a // 5
sage: c
3*5^2 + O(5^9)

\end{verbatim}

Note that when we divided by 5, the precision of \verb/c/ dropped.  This lower precision is now reflected in arithmetic.
\begin{verbatim}
sage: c + b
5 + 2*5^2 + 5^3 + O(5^9)

\end{verbatim}

Division is allowed: the element that results is a capped relative field element, which is discussed in the next section:
\begin{verbatim}
sage: 1 / (c + b)
5^-1 + 3 + 2*5 + 5^2 + 4*5^3 + 4*5^4 + 3*5^6 + O(5^7)

\end{verbatim}

\subsection{Capped Relative Rings and Fields}
Instead of restricting the absolute precision of elements (which doesn't make much sense when elements have negative
valuations), one can cap the relative precision of elements.  This is analogous to floating point representations
of real numbers.  As in the reals, multiplication works very well: the valuations add and the relative precision of
the product is the minimum of the relative precisions of the inputs.   Addition, however, faces similar issues as
floating point addition: relative precision is lost when lower order terms cancel.

To create a capped relative precision ring, use \verb/Zp/ as before.  To create capped relative precision fields, use
\verb/Qp/.
\begin{verbatim}
sage: R = Zp(5, prec = 10, type = 'capped-rel', print_mode = 'series')
sage: R
5-adic Ring with capped relative precision 10
sage: K = Qp(5, prec = 10, type = 'capped-rel', print_mode = 'series')
sage: K
5-adic Field with capped relative precision 10

\end{verbatim}

We can do all of the same operations as in the other two cases, but precision works a bit differently:
the maximum precision of an element is limited by the precision cap of the ring.
\begin{verbatim}
sage: a = R(375)
sage: a
3*5^3 + O(5^13)
sage: b = K(105)
sage: b
5 + 4*5^2 + O(5^11)
sage: a + b
5 + 4*5^2 + 3*5^3 + O(5^11)
sage: a * b
3*5^4 + 2*5^5 + 2*5^6 + O(5^14)
sage: c = a // 5
sage: c
3*5^2 + O(5^12)
sage: c + 1
1 + 3*5^2 + O(5^10)

\end{verbatim}

As with the capped absolute precision rings, we can divide, yielding a capped relative precision field element.
\begin{verbatim}
sage: 1 / (c + b)
5^-1 + 3 + 2*5 + 5^2 + 4*5^3 + 4*5^4 + 3*5^6 + 2*5^7 + 5^8 + O(5^9)

\end{verbatim}

\subsection{Lazy Rings and Fields}

The model for lazy elements is quite different from any of the other
types of $p$-adics.  In addition to storing a finite approximation,
one also stores a method for increasing the precision.  The interface
supports two ways to do this: \verb/set_precision_relative/ and
\verb/set_precision_absolute/.

\begin{verbatim}
sage: R = Zp(5, prec = 10, type = 'lazy', print_mode = 'series', halt = 30)
sage: R
Lazy 5-adic Ring
sage: R.precision_cap()
10
sage: R.halting_parameter()
30
sage: K = Qp(5, type = 'lazy')
sage: K.precision_cap()
20
sage: K.halting_parameter()
40

\end{verbatim}

There are two parameters that are set at the creation of a lazy ring
or field.  The first is \verb/prec/, which controls the precision to
which elements are initially computed.  When computing with lazy
rings, sometimes situations arise where the insolvability of the
halting problem gives us problems.  For example,

\begin{verbatim}
sage: a = R(16)
sage: b = a.log().exp() - a
sage: b
O(5^10)
sage: b.valuation()
Traceback (most recent call last):
...
HaltingError: Stopped computing sum: set halting parameter higher if you want computation to continue

\end{verbatim}

Setting the halting parameter controls to what absolute precision one computes in such a situation.
"""

F = None
def _tex():
    import os
    import tutorial
    from sage.misc.misc import tmp_filename
    global F
    if F is None:
        F = tmp_filename('tutorial')
    T = """
\\documentclass{article}
\\newtheorem{theorem}{Theorem}[section]
\\newtheorem{definition}[theorem]{Definition}

\\title{Tutorial for p-adics in SAGE}
\usepackage{amssymb, amsmath}
\\author{David Roe}
\\date{\\today}
\\def\\ZZ{\\mathbb{Z}}
\\def\\QQ{\\mathbb{Q}}
\\def\\Qp{\\mathbb{Q}_p}
\\def\\Zp{\\mathbb{Z}_p}
\\def\\Zpx{\\mathbb{Z}_p^{\\times}}
\\def\\Zpn{\\mathbb{Z} / p^n\\mathbb{Z}}
\\def\\OK{\\mathcal{O}_K}
\\begin{document}
\\maketitle
%s
\\end{document}
"""%tutorial.__doc__
    os.chdir(os.path.split(F)[0])
    open(F + '.tex', 'w').write(T)
    os.system('latex %s.tex'%F)
    print F + '.dvi'


def _view():
    _tex()
    global F
    import os
    os.system('xdvi %s.dvi &'%F)
sage: quit
localhost:~$ sage
sage: run code that generated bug.
\end{verbatim}
If you want a slightly more stable but older version, use \verb/semistable-version.hg/ instead.
    
